<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="2" name="scale_factor" type="Parameter" version="opset1">
			<data shape="1,2" element_type="f16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="scale_factor" />
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP16" names="scale_factor">
					<dim>1</dim>
					<dim>2</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,?]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="image" type="Parameter" version="opset1">
			<data shape="1,3,608,608" element_type="u8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="image" />
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="U8" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="0" name="im_shape" type="Parameter" version="opset1">
			<data shape="1,2" element_type="f16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="im_shape" />
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP16" names="im_shape">
					<dim>1</dim>
					<dim>2</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,?]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="3" name="Convert_2813" type="Convert" version="opset1">
			<data destination_type="f16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_2813" />
			</rt_info>
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gather_13611_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="0" size="6" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Gather_13611, Gather_13611_compressed" />
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Multiply_11985" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_11985" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Gather_13614_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="6" size="6" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Gather_13614, Gather_13614_compressed" />
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Divide_3316" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Divide_3316" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Gather_13617_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="12" size="1728" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Gather_13617, Gather_13617_compressed" />
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_11989" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_11989" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>608</dim>
					<dim>608</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_11994_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1740" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_11994, Constant_11994_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="batch_norm_0.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_0.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_0.tmp_3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="relu_0.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_0.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_0.tmp_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_12531_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 3, 3" offset="1804" size="18432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12531, Multiply_12531_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_11996" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_11996" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_12001_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="20236" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12001, Constant_12001_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="batch_norm_1.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_1.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_1.tmp_3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="relu_1.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_1.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_1.tmp_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_12537_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="20300" size="36864" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12537, Multiply_12537_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Multiply_12003" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12003" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_12008_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="57164" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12008, Constant_12008_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="batch_norm_2.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_2.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_2.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="relu_2.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_2.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_2.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="pool2d_0.tmp_0" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="pool2d_0.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>304</dim>
					<dim>304</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="pool2d_0.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Multiply_12543_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 1, 1" offset="57292" size="8192" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12543, Multiply_12543_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Multiply_12010" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12010" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_12015_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="65484" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12015, Constant_12015_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="batch_norm_4.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_4.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_4.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="relu_3.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_3.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_3.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Multiply_12549_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="65612" size="73728" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12549, Multiply_12549_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_12017" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12017" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_12022_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="139340" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12022, Constant_12022_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="batch_norm_5.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_5.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_5.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="relu_4.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_4.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_4.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Multiply_12555_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 64, 1, 1" offset="139468" size="32768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12555, Multiply_12555_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Multiply_12024" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12024" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_12029_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="172236" size="512" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12029, Constant_12029_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="batch_norm_6.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_6.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_6.tmp_3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Multiply_12561_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 64, 1, 1" offset="172748" size="32768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12561, Multiply_12561_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Multiply_12031" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12031" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_12036_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="205516" size="512" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12036, Constant_12036_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="batch_norm_3.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_3.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_3.tmp_3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="elementwise_add_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="elementwise_add_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="elementwise_add_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="relu_5.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_5.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_5.tmp_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Multiply_12567_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 256, 1, 1" offset="206028" size="32768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12567, Multiply_12567_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Multiply_12038" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12038" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_12043_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="238796" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12043, Constant_12043_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="batch_norm_7.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_7.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_7.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="relu_6.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_6.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_6.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Multiply_12573_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="238924" size="73728" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12573, Multiply_12573_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_12045" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12045" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_12050_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="312652" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12050, Constant_12050_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="batch_norm_8.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_8.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_8.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="relu_7.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_7.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_7.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Multiply_12579_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 64, 1, 1" offset="312780" size="32768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12579, Multiply_12579_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Multiply_12052" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12052" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_12057_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="345548" size="512" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12057, Constant_12057_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="batch_norm_9.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_9.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_9.tmp_3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="elementwise_add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="elementwise_add_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="elementwise_add_1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="relu_8.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_8.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_8.tmp_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Multiply_12585_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 256, 1, 1" offset="346060" size="32768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12585, Multiply_12585_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Multiply_12059" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12059" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_12064_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="378828" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12064, Constant_12064_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="batch_norm_10.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_10.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_10.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="relu_9.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_9.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_9.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Multiply_12591_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="378956" size="73728" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12591, Multiply_12591_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Multiply_12066" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12066" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_12071_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="452684" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12071, Constant_12071_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="batch_norm_11.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_11.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_11.tmp_3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="relu_10.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_10.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_10.tmp_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Multiply_12597_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 64, 1, 1" offset="452812" size="32768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12597, Multiply_12597_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Multiply_12073" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12073" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_12078_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="485580" size="512" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12078, Constant_12078_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="batch_norm_12.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_12.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_12.tmp_3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="elementwise_add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="elementwise_add_2" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="elementwise_add_2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="relu_11.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_11.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_11.tmp_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Multiply_12603_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256, 1, 1" offset="486092" size="65536" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12603, Multiply_12603_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Multiply_12080" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12080" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_12085_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="551628" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12085, Constant_12085_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="batch_norm_14.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_14.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_14.tmp_3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="relu_12.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_12.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_12.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Multiply_12609_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="551884" size="294912" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12609, Multiply_12609_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Multiply_12087" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12087" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>152</dim>
					<dim>152</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_12092_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="846796" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12092, Constant_12092_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="batch_norm_15.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_15.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_15.tmp_3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="relu_13.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_13.tmp_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="relu_13.tmp_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Multiply_12615_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 128, 1, 1" offset="847052" size="131072" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12615, Multiply_12615_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Multiply_12094" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Multiply_12094" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_12099_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="978124" size="1024" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12099, Constant_12099_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="batch_norm_16.w_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm_16.w_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="batch_norm_16.tmp_3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>76</dim>
					<dim>76</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="pool2d_1.tmp_0" type="AvgPool" version="opset1">
